//var
//let
//const
// 'use strict';
let number = 5;
const leftBorderWidth = 10;

console.log(number,leftBorderWidth);
//создали коробочку, названи "чисто", и положили в нее (присваивание) значение

//название из букв, цифр, символов доллара и подчеркивания. нельзя использовать зарезервированные слова

//прямых констант в js не быват. 


//устаревший вариант записи!!!!!!!!!!!!!

var name = 'ivan';
//хойстинг(всплытие) переменных.


/** ккак скказать коду, что мы используем современный режим? 
 * нужно заюзать use strict
 */
a=15;
console.log(a);